//===========================================================================
//!
//!	@file		String.h
//!	@brief		文字列操作.
//!
//!	@author		Copyright (C) DebugCurry. All rights reserved.
//!	@author		d0
//!
//===========================================================================
#pragma once

namespace aroma {
namespace data {

//---------------------------------------------------------------------------
//!	@brief		文字列のコピー.
//!
//! @param[out]	srcStr		コピー元文字列.
//!
//! @return		コピーした文字列のバッファを指すポインタ.
//!
//! @details
//!		mallocでメモリ確保されたバッファを文字列として返却しているので,
//!		返却された文字列バッファは最終的にfreeで解放して下さい.
//---------------------------------------------------------------------------
TStr StrCopy( CTStr srcStr );

} // namespace data
} // namespace aroma
